{
  "name" : "RoutingKey",
  "qualifiedName" : "io.fluxzero.sdk.publishing.routing.RoutingKey",
  "packageName" : "io.fluxzero.sdk.publishing.routing",
  "kind" : "annotation_type",
  "modifiers" : [ "abstract", "public" ],
  "annotations" : [ {
    "annotationType" : "java.lang.annotation.Target",
    "values" : {
      "value" : "METHOD,FIELD,TYPE"
    }
  }, {
    "annotationType" : "java.lang.annotation.Retention",
    "values" : {
      "value" : "RUNTIME"
    }
  } ],
  "documentation" : " Annotation used to identify the routing key of a message, which in turn is used to compute the message segment using\n consistent hashing. If the routing key and thus segment of two messages are equal, the messages are always given to a\n consumer in order. Often, this is used to ensure that messages about the same subject (say one aggregate), aren't\n handled in parallel to prevent concurrent modifications.\n <p>\n This annotation can be used as a field, method or type annotation in a payload class. If placed on a method, that\n method must contain no parameters. If it is on a field or getter method it uses the property to obtain the routing\n key. The value of the property will be converted to a string via the value's {@code toString()} method.\n <p>\n If the annotation is used at the class level of the payload class, a property name should be specified using\n {@link #value()}. That property will first be looked up inside the message's\n {@link io.fluxzero.common.api.Metadata}. If it is not found there, the property will be looked for inside the\n payload. In that case, the property name may also contain one or more slashes ('/') if the property is hiding inside\n an embedded field.\n <p>\n Finally, it is also possible to place this annotation on a handler method. In that case, the property name specified\n by {@link #value()} of the payload (metadata or payload property) will be used to compute the routing key before\n handling. This effectively overrides any routing key computed upon publication of the message. <b>Important note:</b>\n if the annotation is on a handler method, make sure the consumer configuration has <code>ignoreSegment =\n true</code>; otherwise messages may be missed by the consumer.\n",
  "typeParameters" : [ ],
  "superClass" : null,
  "interfaces" : [ "java.lang.annotation.Annotation" ],
  "fields" : [ ],
  "constructors" : [ ],
  "methods" : [ {
    "name" : "value",
    "qualifiedName" : "io.fluxzero.sdk.publishing.routing.RoutingKey#value",
    "returnType" : "java.lang.String",
    "modifiers" : [ "abstract", "public" ],
    "annotations" : [ ],
    "typeParameters" : [ ],
    "parameters" : [ ],
    "thrownTypes" : [ ],
    "varArgs" : false,
    "documentation" : " Returns the metadata key or property name to use to look up the routing key. If left empty, the annotated field\n or method will be used to determine the routing key.\n"
  } ],
  "enumConstants" : [ ],
  "recordComponents" : [ ],
  "nestedTypes" : [ ]
}
